Revit 2027 API
ElementMulticategoryFilter.GetCategoryIds Method
 Gets the category ids assigned to this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetCategoryIds()
Public Function GetCategoryIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetCategoryIds()
member GetCategoryIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The category ids.
See Also
Reference
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace